 {
    "Anthracnose": "A fungal disease that causes dark, sunken lesions on leaves, stems, flowers, and fruits. It commonly affects a wide range of plants, including vegetables, fruits, and ornamental plants.",
    "Apple Scab": "A fungal disease affecting apple trees, leading to dark, scabby lesions on leaves, fruit, and twigs. It reduces fruit quality and can cause significant crop loss.",
    "Black Spot": "A common fungal disease on roses, characterized by black spots on leaves, which can lead to defoliation. It thrives in humid conditions and can weaken the plant over time.",
    "Blight": "A term for various plant diseases that cause rapid and complete chlorosis, browning, and death of plant tissues such as leaves, branches, twigs, or floral organs.",
    "Blossom End Rot": "A physiological disorder caused by calcium deficiency in the fruit, leading to dark, sunken spots on the blossom end of tomatoes, peppers, and other fruits.",
    "Botrytis": "Also known as gray mold, this fungal disease affects many plants, causing a gray, fuzzy mold on leaves, stems, flowers, and fruits, especially in humid conditions.",
    "Brown Rot": "A fungal disease that affects stone fruits like peaches, cherries, and plums, causing fruit rot, cankers, and blossom blight. Infected fruit becomes brown, shriveled, and mummified.",
    "Canker": "A disease causing lesions on the bark of trees and shrubs, which can lead to dieback of twigs and branches. Caused by bacteria, fungi, or environmental stress.",
    "Cedar Apple Rust": "A fungal disease that requires both cedar and apple trees to complete its life cycle. It causes bright orange, gelatinous galls on cedars and yellow-orange spots on apple leaves.",
    "Clubroot": "A soil-borne disease caused by a protozoan, affecting cruciferous vegetables like cabbage and broccoli. It causes swelling and distortion of roots, leading to stunted growth.",
    "Crown Gall": "A bacterial disease that causes tumor-like growths (galls) on the roots and stems of many plants. It disrupts nutrient and water flow, leading to weakened plants.",
    "Downy Mildew": "A fungal-like disease causing yellowing and browning of leaf tissues, often with a white, downy growth on the underside of leaves. It thrives in cool, moist conditions.",
    "Fire Blight": "A bacterial disease affecting apples, pears, and other rosaceous plants, causing wilting and blackening of blossoms, shoots, and branches, giving a scorched appearance.",
    "Fusarium": "A soil-borne fungal disease that causes wilting, yellowing, and browning of plant tissues. It affects a wide range of plants, including vegetables and ornamentals.",
    "Gray Mold": "Caused by Botrytis cinerea, this fungal disease affects many plants, leading to gray, fuzzy mold on leaves, flowers, stems, and fruits, particularly under cool, damp conditions.",
    "Leaf Spots": "Caused by various fungi and bacteria, these diseases produce spots of different colors on leaves, which can merge and cause significant leaf damage or defoliation.",
    "Mosaic Virus": "A viral disease causing mottled, yellowed, or curled leaves with a mosaic-like pattern. It stunts plant growth and reduces crop yield and quality.",
    "Nematodes": "Microscopic worms that attack plant roots, causing galls, lesions, and root knots. They impair water and nutrient uptake, leading to stunted growth and reduced yields.",
    "Powdery Mildew": "A fungal disease characterized by white, powdery spots on leaves, stems, and flowers. It can cause leaf curling, distortion, and reduced plant vigor.",
    "Verticillium": "A soil-borne fungal disease causing wilting, yellowing, and browning of leaves, often starting on one side of the plant. It affects a wide range of crops and ornamental plants."
}
